We recreated the cluster from scratch, we run the plan twice and it worked

@sullivtr  if it helps this was part of the plan the first time

```
  # graphql_mutation.agent_token will be created
  + resource "graphql_mutation" "agent_token" {
      + compute_from_create                 = true
      + compute_mutation_keys               = {
          + "secret"   = "clusterAgentTokenCreate.secret"
          + "token_id" = "clusterAgentTokenCreate.token.id"
        }
      + computed_delete_operation_variables = (known after apply)
      + computed_read_operation_variables   = (known after apply)
      + computed_update_operation_variables = (known after apply)
      + create_mutation                     = <<-EOT
                mutation createToken($agent_id: ClustersAgentID!, $token_name: String!, $token_description: String!) {
                  clusterAgentTokenCreate(input: {clusterAgentId: $agent_id, description: $token_description, name: $token_name}) {
                    secret
                    token {
                      createdAt
                      id
                    }
                  errors
                  }
                }
        EOT
      + delete_mutation                     = <<-EOT
                mutation deleteToken($token_id: ClustersAgentTokenID!) {
                  clusterAgentTokenDelete(input: {id: $token_id}) {
                    errors
                  }
                }
        EOT
      + existing_hash                       = (known after apply)
      + id                                  = (known after apply)
      + mutation_variables                  = (known after apply)
      + query_response                      = (known after apply)
      + query_response_input_key_map        = (known after apply)
      + read_query                          = <<-EOT
                query getToken($agent_name: String!, $project_path: ID!) {
                  project(fullPath: $project_path) {
                    name
                    id
                    clusterAgent(name: $agent_name) {
                      id
                      tokens {
                        edges {
                          node {
                            id
                            name
                            description
                          }
                        }
                      }
                    }
                  }
                }
        EOT
      + read_query_variables                = {
          + "agent_name"   = "gke-agent"
          + "project_path" = "xxxx/xxxx/terraform/terraform-example"
        }
      + update_mutation                     = <<-EOT
                mutation updateToken($token_id: ClustersAgentTokenID!, $agent_id: ClustersAgentID!, $token_name: String!, $token_description: String!) {
                  clusterAgentTokenDelete(input: {id: $token_id}) {
                    errors
                  }
                  clusterAgentTokenCreate(input: {clusterAgentId: $agent_id, description: $token_description, name: $token_name}) {
                    secret
                    token {
                      createdAt
                      id
                    }
                  errors
                  }
                }
        EOT
    }
  # graphql_mutation.cluster_agent will be created
  + resource "graphql_mutation" "cluster_agent" {
      + compute_from_create                 = false
      + compute_mutation_keys               = {
          + "id"   = "project.clusterAgent.id"
          + "name" = "project.clusterAgent.name"
        }
      + computed_delete_operation_variables = (known after apply)
      + computed_read_operation_variables   = (known after apply)
      + computed_update_operation_variables = (known after apply)
      + create_mutation                     = <<-EOT
                mutation createAgent($project_path: ID!, $agent_name: String!) {
                  createClusterAgent(input: { projectPath: $project_path, name: $agent_name }) {
                    clusterAgent {
                      id
                      name
                    }
                  errors
                  }
                }
        EOT
      + delete_mutation                     = <<-EOT
                mutation deleteAgent($id: ID!) {
                  clusterAgentDelete(input: {id: $id}) {
                  errors
                  }
                }
        EOT
      + existing_hash                       = (known after apply)
      + id                                  = (known after apply)
      + mutation_variables                  = {
          + "agent_name"   = "gke-agent"
          + "project_path" = "xxxx/xxxx/terraform/terraform-example"
        }
      + query_response                      = (known after apply)
      + query_response_input_key_map        = (known after apply)
      + read_query                          = <<-EOT
                query getAgent($agent_name: String!, $project_path: ID!) {
                  project(fullPath: $project_path) {
                    fullPath
                    clusterAgent(name: $agent_name) {
                      id
                      name
                    }
                  }
                }
        EOT
      + read_query_variables                = {
          + "agent_name"   = "gke-agent"
          + "project_path" = "xxxx/xxxx/terraform/terraform-example"
        }
      + update_mutation                     = <<-EOT
                mutation updateAgent($id: ID!, $project_path: ID!, $agent_name: String!) {
                  clusterAgentDelete(input: {id: $id}) {
                  errors
                  }
                  createClusterAgent(input: { projectPath: $project_path, name: $agent_name }) {
                    clusterAgent {
                      id
                      name
                    }
                  errors
                  }
                }
        EOT
    }
```

and the second time  

```
# kubernetes_cluster_role.gitlab-agent-read has changed
  ~ resource "kubernetes_cluster_role" "gitlab-agent-read" {
        id = "gitlab-agent-read"
      ~ metadata {
          + annotations      = {}
          + labels           = {}
            name             = "gitlab-agent-read"
            # (3 unchanged attributes hidden)
        }
      ~ rule {
          + non_resource_urls = []
          + resource_names    = []
            # (3 unchanged attributes hidden)
        }
    }
  # kubernetes_cluster_role.gitlab-agent-write has changed
  ~ resource "kubernetes_cluster_role" "gitlab-agent-write" {
        id = "gitlab-agent-write"
      ~ metadata {
          + annotations      = {}
          + labels           = {}
            name             = "gitlab-agent-write"
            # (3 unchanged attributes hidden)
        }
      ~ rule {
          + non_resource_urls = []
          + resource_names    = []
            # (3 unchanged attributes hidden)
        }
    }
  # kubernetes_cluster_role_binding.gitlab-admin has changed
  ~ resource "kubernetes_cluster_role_binding" "gitlab-admin" {
        id = "gitlab-admin"
      ~ metadata {
          + annotations      = {}
          + labels           = {}
            name             = "gitlab-admin"
            # (3 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }
  # kubernetes_cluster_role_binding.gitlab-agent-cluster-admin has changed
  ~ resource "kubernetes_cluster_role_binding" "gitlab-agent-cluster-admin" {
        id = "gitlab-agent-cluster-admin"
      ~ metadata {
          + annotations      = {}
          + labels           = {}
            name             = "gitlab-agent-cluster-admin"
            # (3 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }
  # kubernetes_cluster_role_binding.gitlab-agent-read-binding has changed
  ~ resource "kubernetes_cluster_role_binding" "gitlab-agent-read-binding" {
        id = "gitlab-agent-read-binding"
      ~ metadata {
          + annotations      = {}
          + labels           = {}
            name             = "gitlab-agent-read-binding"
            # (3 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }
  # kubernetes_cluster_role_binding.gitlab-agent-write-binding has changed
  ~ resource "kubernetes_cluster_role_binding" "gitlab-agent-write-binding" {
        id = "gitlab-agent-write-binding"
      ~ metadata {
          + annotations      = {}
          + labels           = {}
            name             = "gitlab-agent-write-binding"
            # (3 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }
  # kubernetes_deployment.gitlab-agent has changed
  ~ resource "kubernetes_deployment" "gitlab-agent" {
        id               = "gitlab-agent/gitlab-agent"
        # (1 unchanged attribute hidden)
      ~ metadata {
          + annotations      = {}
          + labels           = {}
            name             = "gitlab-agent"
          ~ resource_version = "[299](https://gitlab.com/zweicom/devops/terraform/terraform-example/-/jobs/2165923087#L299)8" -> "4525"
            # (3 unchanged attributes hidden)
        }
      ~ spec {
            # (5 unchanged attributes hidden)
          ~ template {
              ~ metadata {
                  + annotations = {}
                    # (2 unchanged attributes hidden)
                }
              ~ spec {
                  + node_selector                    = {}
                    # (11 unchanged attributes hidden)
                  ~ container {
                      + command                    = []
                        name                       = "agent"
                        # (8 unchanged attributes hidden)
                        # (2 unchanged blocks hidden)
                    }
                    # (1 unchanged block hidden)
                }
            }
            # (2 unchanged blocks hidden)
        }
    }
  # kubernetes_namespace.gitlab-agent has changed
  ~ resource "kubernetes_namespace" "gitlab-agent" {
        id = "gitlab-agent"
      ~ metadata {
          + labels           = {}
            name             = "gitlab-agent"
            # (4 unchanged attributes hidden)
        }
    }
  # kubernetes_namespace.gitops-apps has changed
  ~ resource "kubernetes_namespace" "gitops-apps" {
        id = "gitops-apps"
      ~ metadata {
          + labels           = {}
            name             = "gitops-apps"
            # (4 unchanged attributes hidden)
        }
    }
  # kubernetes_secret.gitlab-agent-token has changed
  ~ resource "kubernetes_secret" "gitlab-agent-token" {
        id        = "gitlab-agent/gitlab-agent-token"
        # (3 unchanged attributes hidden)
      ~ metadata {
          + annotations      = {}
          + labels           = {}
            name             = "gitlab-agent-token"
            # (4 unchanged attributes hidden)
        }
    }
  # kubernetes_service_account.gitlab-admin has changed
  ~ resource "kubernetes_service_account" "gitlab-admin" {
        id                              = "kube-system/gitlab-admin"
        # (2 unchanged attributes hidden)
      ~ metadata {
          + annotations      = {}
          + labels           = {}
            name             = "gitlab-admin"
            # (4 unchanged attributes hidden)
        }
    }
  # kubernetes_service_account.gitlab-agent has changed
  ~ resource "kubernetes_service_account" "gitlab-agent" {
        id                              = "gitlab-agent/gitlab-agent"
        # (2 unchanged attributes hidden)
      ~ metadata {
          + annotations      = {}
          + labels           = {}
            name             = "gitlab-agent"
            # (4 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }
```

it seems our problem was might be related with the terraform cache,  

@sullivtr thaks for your help